In [97]:
import numpy as np 
import pandas as pd

In [98]:
#open the data 
f500 = pd.read_csv("f500.csv")
f500.head(3)

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
0,Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
1,State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
2,Sinopec Group,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4,China,"Beijing, China",http://www.sinopec.com,19,713288,106523

In [99]:
f500.loc[f500["previous_rank"] == 0, "previous_rank"] = np.nan
f500_selection = f500[["rank" , "revenues", "revenue_change"]].head()
f500["previous_rank"]

0        1.0
1        2.0
2        4.0
3        3.0
4        8.0
       ...
495      NaN
496    427.0
497    437.0
498    467.0
499      NaN
Name: previous_rank, Length: 500, dtype: float64

In [100]:
f500["company"]

0                             Walmart
1                          State Grid
2                       Sinopec Group
3            China National Petroleum
4                        Toyota Motor
                    ...
495    Teva Pharmaceutical Industries
496          New China Life Insurance
497         Wm. Morrison Supermarkets
498                               TUI
499                        AutoNation
Name: company, Length: 500, dtype: object

In [101]:
f500.iloc[0]
f500.iloc[2]

company                              Sinopec Group
rank                                             3
revenues                                    267518
revenue_change                                -9.1
profits                                     1257.9
assets                                      310726
profit_change                                  -65
ceo                                      Wang Yupu
industry                        Petroleum Refining
sector                                      Energy
previous_rank                                    4
country                                      China
hq_location                         Beijing, China
website                     http://www.sinopec.com
years_on_global_500_list                        19
employees                                   713288
total_stockholder_equity                    106523
Name: 2, dtype: object

In [102]:
f500.iloc[155].loc["company"]

'ArcelorMittal'

In [103]:
f500.iloc[400].loc["revenues"]

27131

In [104]:
f500.iloc[400].loc["company"]

'USAA'

In [105]:
f500.iloc[:,7].loc[7]

'Warren E. Buffett'

In [106]:
f500.iloc[:,2].loc[499]

21609

In [107]:
f500["company"].value_counts()

Credit Suisse Group                   1
Boeing                                1
Duke Energy                           1
SK Holdings                           1
SAIC Motor                            1
                                     ..
Cisco Systems                         1
Taiwan Semiconductor Manufacturing    1
Poste Italiane                        1
China Southern Power Grid             1
Enbridge                              1
Name: company, Length: 500, dtype: int64

In [108]:
company = f500.iloc[:,0]
company[[10,20,200]].loc[10]

'McKesson'

In [109]:
f500.iloc[0,0]

'Walmart'

In [110]:
f500.iloc[:,-1]

0       77798
1      209456
2      106523
3      301893
4      157210
        ...
495     33337
496      8507
497      5111
498      3006
499      2310
Name: total_stockholder_equity, Length: 500, dtype: int64

In [111]:
f500.iloc[[1,7]]

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
1,State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2.0,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
7,Berkshire Hathaway,8,223604,6.1,24074.0,620854,NaN,Warren E. Buffett,Insurance: Property and Casualty (Stock),Financials,11.0,USA,"Omaha, NE",http://www.berkshirehathaway.com,21,367700,283001

In [112]:
#boolean masking using pandas methods
f500.loc[:,"revenues"].notnull().value_counts()

True    500
Name: revenues, dtype: int64

In [113]:
f500.loc[:,"country"].notnull().value_counts()

True    500
Name: country, dtype: int64

In [114]:
profit_cahnge_countries = f500.loc[f500["profit_change"].notnull() , "company"]
profit_cahnge_countries

0                             Walmart
1                          State Grid
2                       Sinopec Group
3            China National Petroleum
4                        Toyota Motor
                    ...
495    Teva Pharmaceutical Industries
496          New China Life Insurance
497         Wm. Morrison Supermarkets
498                               TUI
499                        AutoNation
Name: company, Length: 436, dtype: object

In [115]:
null_profit_comanies = f500.loc[f500["profit_change"].isnull() , ["company" , "rank" , "country"]]
null_profit_comanies

                                          company  rank      country
5                                      Volkswagen     6      Germany
7                              Berkshire Hathaway     8          USA
11                                             BP    12      Britain
15                                       Glencore    16  Switzerland
22                              AmerisourceBergen    23          USA
..                                            ...   ...          ...
472                                        Altice   473  Netherlands
473                                          Onex   474       Canada
475  Shanxi Jincheng Anthracite Coal Mining Group   476        China
488                                Sears Holdings   489          USA
492                                Telecom Italia   493        Italy

[64 rows x 3 columns]

In [116]:
f500.loc[f500["profit_change"].notnull() , "company"]

0                             Walmart
1                          State Grid
2                       Sinopec Group
3            China National Petroleum
4                        Toyota Motor
                    ...
495    Teva Pharmaceutical Industries
496          New China Life Insurance
497         Wm. Morrison Supermarkets
498                               TUI
499                        AutoNation
Name: company, Length: 436, dtype: object

In [117]:
null_prev_rank  = f500.loc[f500["previous_rank"].isnull() , ["company" , "rank" , "previous_rank"]]
null_prev_rank

                                   company  rank  previous_rank
48                   Legal & General Group    49            NaN
90                                  Uniper    91            NaN
123                      Dell Technologies   124            NaN
138                 Anbang Insurance Group   139            NaN
140                        Albertsons Cos.   141            NaN
180             Hewlett Packard Enterprise   181            NaN
267                           Hengli Group   268            NaN
271         Johnson Controls International   272            NaN
341                                  Chubb   342            NaN
375                 Charter Communications   376            NaN
376                              Medtronic   377            NaN
392                               Facebook   393            NaN
409                            Kraft Heinz   410            NaN
414                                  Nokia   415            NaN
431                          Standard Life   432            NaN
440            Brookfield Asset Management   441            NaN
441        Mercantil Servicios Financieros   442            NaN
446                            Samsung C&T   447            NaN
456                        Heraeus Holding   457            NaN
458                Yango Financial Holding   459            NaN
461                  Alibaba Group Holding   462            NaN
463                            Progressive   464            NaN
466                Country Garden Holdings   467            NaN
472                                 Altice   473            NaN
477                       Tencent Holdings   478            NaN
482                                  Aflac   483            NaN
484                  Suning Commerce Group   485            NaN
487                             Xiamen C&D   488            NaN
491                         Dollar General   492            NaN
493               Xiamen ITG Holding Group   494            NaN
494  Xinjiang Guanghui Industry Investment   495            NaN
495         Teva Pharmaceutical Industries   496            NaN
499                             AutoNation   500            NaN

In [118]:
#the difference between df.loc[] and df.iloc[] 
#df.loc[] we use the label of the column null_previous_rank.loc[48] for first row
#df.iloc[] for the integer indexing null_previous_rank.iloc[0] for first row
null_prev_rank.loc[495] #label

company          Teva Pharmaceutical Industries
rank                                        496
previous_rank                               NaN
Name: 495, dtype: object

In [119]:
null_prev_rank.iloc[31] #integer index

company          Teva Pharmaceutical Industries
rank                                        496
previous_rank                               NaN
Name: 495, dtype: object

In [120]:
null_prev_rank.reindex([98,120,499])

        company   rank  previous_rank
98          NaN    NaN            NaN
120         NaN    NaN            NaN
499  AutoNation  500.0            NaN

In [121]:
null_prev_rank.iloc[0:5]

                    company  rank  previous_rank
48    Legal & General Group    49            NaN
90                   Uniper    91            NaN
123       Dell Technologies   124            NaN
138  Anbang Insurance Group   139            NaN
140         Albertsons Cos.   141            NaN

In [122]:
# pandas index alignment
prev_rank= f500[f500["previous_rank"].notnull()]
rank_change = prev_rank["previous_rank"] - prev_rank["rank"]
print(rank_change.shape)
rank_change.tail()

(467,)

490   -20.0
492   -89.0
496   -70.0
497   -61.0
498   -32.0
dtype: float64

In [123]:
# assign new column to the data 
f500["rank_change"] = rank_change
f500["rank_change"]

0       0.0
1       0.0
2       1.0
3      -1.0
4       3.0
       ...
495     NaN
496   -70.0
497   -61.0
498   -32.0
499     NaN
Name: rank_change, Length: 500, dtype: float64

In [124]:
notnull_rev = f500.loc[f500["revenues"].notnull()]
subt_rev = notnull_rev["revenues"] - 1000
f500["new_rev"] = subt_rev
f500["new_rev"]

0      484873
1      314199
2      266518
3      261573
4      253694
        ...
495     20903
496     20796
497     20741
498     20655
499     20609
Name: new_rev, Length: 500, dtype: int64

In [125]:
f500_sel = f500[["company" , "revenues", "country"]].head()
china = f500["country"] == "China"
over_265 = f500["revenues"] > 265000
combined = china & over_265
chinese_companies = f500.loc[combined , ["company" , "country" , "revenues"]]
chinese_companies

         company country  revenues
1     State Grid   China    315199
2  Sinopec Group   China    267518

In [126]:
usa = f500["country"] == "USA"
over_20 = f500["revenues"] > 200000
combined = usa & over_20
us_comp = f500.loc[combined , ["company" , "country" , "rank"]]
us_comp

              company country  rank
0             Walmart     USA     1
7  Berkshire Hathaway     USA     8
8               Apple     USA     9
9         Exxon Mobil     USA    10

In [127]:
ger = f500["country"] == "Germany"
fra = f500["country"] == "France"
compined = ger | fra
f500.loc[compined , ["company" , "country"]].head()

       company  country
5   Volkswagen  Germany
16     Daimler  Germany
24         AXA   France
29       Total   France
33     Allianz  Germany

In [136]:
over_100 = f500["revenues"] > 100000
neg_profit = f500["profits"] < 0
comined = over_100 & neg_profit 
big_rev_neg_profit = f500.loc[combined , "company"]
big_rev_neg_profit

0               Walmart
7    Berkshire Hathaway
8                 Apple
9           Exxon Mobil
Name: company, dtype: object

In [144]:
# companies in USA or china with revenues more than 100 billions
top_china_usa = f500.loc[(f500["country"] == "USA") | (f500["country"] == "China") & (f500["revenues"] > 100000) , ["company" , "country"] ]
top_china_usa["country"].describe()

count     144
unique      2
top       USA
freq      132
Name: country, dtype: object

In [148]:
# brazil | venezeula
brazil_or_venezula = f500.loc[(f500["country"] == "Brazil") | (f500["country"] == "Venezuela") , "company"]
brazil_or_venezula

74                           Petrobras
112              Itau Unibanco Holding
150                    Banco do Brasil
153                     Banco Bradesco
190                                JBS
369                               Vale
441    Mercantil Servicios Financieros
486                  Ultrapar Holdings
Name: company, dtype: object

In [131]:
tech_companies = f500.loc[(f500["country"] != "USA") & (f500["sector"] == "Technology") , "company"]
tech_companies.head()

14             Samsung Electronics
26      Hon Hai Precision Industry
70                         Hitachi
82     Huawei Investment & Holding
104                           Sony
Name: company, dtype: object

In [150]:
chinese = f500.loc[f500["country"] == "China"]
sorted_rows = chinese.sort_values(by = "employees" , ascending = False)
sorted_rows[["company" , "rank" , "employees"]].head()

                        company  rank  employees
3      China National Petroleum     4    1512048
118            China Post Group   119     941211
1                    State Grid     2     926067
2                 Sinopec Group     3     713288
37   Agricultural Bank of China    38     501368

In [133]:
#japanese country most employee
japanese = f500[f500["country"] == "Japan"]
sorted_rows = japanese[["company" , "employees"]].sort_values(by = "employees" , ascending = False)
sorted_rows.head()
sorted_rows.iloc[0].loc["company"]

'Toyota Motor'

In [134]:
f500[["company" , "country"]].sort_values(by = "country" , axis = 0)

                                   company    country
197                             Wesfarmers  Australia
390                        Westpac Banking  Australia
404                National Australia Bank  Australia
349                           BHP Billiton  Australia
417  Australia & New Zealand Banking Group  Australia
..                                     ...        ...
257                               Best Buy        USA
259                Honeywell International        USA
228                                  Bunge        USA
499                             AutoNation        USA
441        Mercantil Servicios Financieros  Venezuela

[500 rows x 2 columns]

In [154]:
# using loops with pandas 
#to calculate the average revenue for each country in the data set
avg_rev = {}
countries = f500["country"].unique()
for c in countries:
    selected_rows = f500[f500["country"] == c]
    mean = selected_rows["revenues"].mean()
    avg_rev[c] = mean
    
avg_rev

{'USA': 64218.371212121216,
 'China': 55397.880733944956,
 'Japan': 53164.03921568627,
 'Germany': 63915.0,
 'Netherlands': 61708.92857142857,
 'Britain': 51588.708333333336,
 'South Korea': 49725.6,
 'Switzerland': 51353.57142857143,
 'France': 55231.793103448275,
 'Taiwan': 46364.666666666664,
 'Singapore': 54454.333333333336,
 'Italy': 51899.57142857143,
 'Russia': 65247.75,
 'Spain': 40600.666666666664,
 'Brazil': 52024.57142857143,
 'Mexico': 54987.5,
 'Luxembourg': 56791.0,
 'India': 39993.0,
 'Malaysia': 49479.0,
 'Thailand': 48719.0,
 'Australia': 33688.71428571428,
 'Belgium': 45905.0,
 'Norway': 45873.0,
 'Canada': 31848.0,
 'Ireland': 32819.5,
 'Indonesia': 36487.0,
 'Denmark': 35464.0,
 'Saudi Arabia': 35421.0,
 'Sweden': 27963.666666666668,
 'Finland': 26113.0,
 'Venezuela': 24403.0,
 'Turkey': 23456.0,
 'U.A.E': 22799.0,
 'Israel': 21903.0}

In [157]:
#the top employer in each country:
top_employer = {}
for c in countries:
    selected_rows = f500[f500["country"] == c]
    employer = selected_rows.sort_values(by = "employees" , ascending = False).iloc[0].loc["company"]
    top_employer[c] = employer
    
top_employer

{'USA': 'Walmart',
 'China': 'China National Petroleum',
 'Japan': 'Toyota Motor',
 'Germany': 'Volkswagen',
 'Netherlands': 'EXOR Group',
 'Britain': 'Compass Group',
 'South Korea': 'Samsung Electronics',
 'Switzerland': 'Nestle',
 'France': 'Sodexo',
 'Taiwan': 'Hon Hai Precision Industry',
 'Singapore': 'Flex',
 'Italy': 'Poste Italiane',
 'Russia': 'Gazprom',
 'Spain': 'Banco Santander',
 'Brazil': 'JBS',
 'Mexico': 'America Movil',
 'Luxembourg': 'ArcelorMittal',
 'India': 'State Bank of India',
 'Malaysia': 'Petronas',
 'Thailand': 'PTT',
 'Australia': 'Wesfarmers',
 'Belgium': 'Anheuser-Busch InBev',
 'Norway': 'Statoil',
 'Canada': 'George Weston',
 'Ireland': 'Accenture',
 'Indonesia': 'Pertamina',
 'Denmark': 'Maersk Group',
 'Saudi Arabia': 'SABIC',
 'Sweden': 'H & M Hennes & Mauritz',
 'Finland': 'Nokia',
 'Venezuela': 'Mercantil Servicios Financieros',
 'Turkey': 'Koc Holding',
 'U.A.E': 'Emirates Group',
 'Israel': 'Teva Pharmaceutical Industries'}

In [162]:
#chalenge calculate returning by assets on country
# create a new column for the assets metric for each cpmpany
f500["roa"] = f500["profits"] / f500["assets"]

top_roa_by_sector = {}
sectors = f500["sector"].unique()
for s in sectors:
    selected_rows = f500[f500["sector"] == s].sort_values(by = "roa" , ascending = False)
    country = selected_rows.iloc[0].loc["company"]
    top_roa_by_sector[s] = country

top_roa_by_sector

{'Retailing': 'H & M Hennes & Mauritz',
 'Energy': 'National Grid',
 'Motor Vehicles & Parts': 'Subaru',
 'Financials': 'Berkshire Hathaway',
 'Technology': 'Accenture',
 'Wholesalers': 'McKesson',
 'Health Care': 'Gilead Sciences',
 'Telecommunications': 'KDDI',
 'Engineering & Construction': 'Pacific Construction Group',
 'Industrials': '3M',
 'Food & Drug Stores': 'Publix Super Markets',
 'Aerospace & Defense': 'Lockheed Martin',
 'Food, Beverages & Tobacco': 'Philip Morris International',
 'Household Products': 'Unilever',
 'Transportation': 'Delta Air Lines',
 'Materials': 'CRH',
 'Chemicals': 'LyondellBasell Industries',
 'Media': 'Disney',
 'Apparel': 'Nike',
 'Hotels, Restaurants & Leisure': 'McDonald’s',
 'Business Services': 'Adecco Group'}